---
kind: enumMember
id: F:Autodesk.Revit.DB.CategoryType.Invalid
enum: Autodesk.Revit.DB.CategoryType
source: html/eb96f224-a134-50e6-57e8-32bcb13bee7d.htm
---
# Autodesk.Revit.DB.CategoryType.Invalid

The category type is invalid.